// 1 - РЕАЛИЗОВАТЬ АНИМАЦИИ ПЕРСОНАЖА: ГОТОВО!!!!!
// 1.1 - idle - ГОТОВО!!!!!
// 1.2 - walk - ГОТОВО!!!!!
// 1.3 - jump - ГОТОВО!!!!!
// 1.4 - fall - ГОТОВО!!!!!
// 1.5 - down - ГОТОВО!!!!!
// 1.6 - attack idle - ГОТОВО!!!!!
// 1.7 - attack jump - ГОТОВО!!!!!
// 1.8 - ПЕРЕДВИЖЕНИЕ ПО ЛЕСТНИЦЕ...  - ГОТОВО!!!!!

// 2 - РЕАЛИЗОВАТЬ ПЕРЕДВИЖЕНИЕ ПО ЛЕСТНИЦАМ - ГОТОВО!!!!


// 3 - ОГРАНИЧИТЬ СТРЕЛЬБУ ИЗ ЧАСТИ АНИМАЦИЙ!} ГОТОВО!!!!
// В КАКИХ ПОЛОЖЕНИЯХ ДОЛЖНА БЫТЬ СТРЕЛЬБА?   } ГОТОВО!!!!
// idle                                        } ГОТОВО!!!!
// walk                                        } ГОТОВО!!!!
// jump                                       } ГОТОВО!!!!
// jumpDown                                  } ГОТОВО!!!!

// 4 СОЗДАТЬ HEALTH MANAGER - ГОТОВО!!!!

// 5 - РЕАЛИЗОВАТЬ MAGIC BULLET - ГОТОВО!!!
// 5.1 анимация полета - ГОТОВО!!!
// 5.2 анимация попадания - ГОТОВО!!!
// 5.3 damage dealer - ГОТОВО!!!
// 5.4 задержка повторного выстрела ГОТОВО!!!

// 6 - РЕАЛИЗОВАТЬ ПЕРЕЗАРЯДКУ ОРУЖИЯ - ГОТОВО!!!

// 7 - СОЗДАТЬ UI УРОВНЯ
//
// В режиме игры на экране отображается четыре элемента интерфейса: - ГОТОВО!!!
//
// Счётчик здоровья(HP) отображает здоровье игрока. - ГОТОВО!!!
// Счётчик патронов (Ammo) показывает количество патронов у игрока. - ГОТОВО!!!
// Счётчик набранных очков (Score). - ГОТОВО!!!
// Кнопка паузы включает панель паузы и останавливает время в игре. - ГОТОВО!!!
// Меню паузы (Pause) содержит три кнопки (Continue, Menu и Quit): - ГОТОВО!!!

// При нажатии на кнопку «продолжить» (Continue) панель паузы закрывается, время в игре возвращается к первоначальному значению, равному единице. - ГОТОВО!!!
// При нажатии на кнопку «заново» (Repeat) перезагружается сцена с игрой (счёт и состояние игры не сохраняются). - ГОТОВО!!!
// При нажатии на кнопку «меню» (Menu) — переход в главное меню (счёт и состояние игры не сохраняются). - ГОТОВО!!!

// 8 - визуализировать перезарядку оружия в UI - ГОТОВО!!!

// 9 - РЕАЛИЗОВАТЬ ЗАДЕРЖКУ ВОЗМОЖНОСТИ ПРЫГАТЬ - ГОТОВО!!!

// 10 - СОЗДАТЬ НЕБОЛЬШОЙ УЧАСТОК УРОВНЯ ДЛЯ ДАЛЬНЕЙШЕЙ ОТЛАДКИ - ГОТОВО!!!




// 11 - СОЗДАТЬ ПРОТИВНИКА БЛИЖНЕГО БОЯ:
// Враги ближней атаки начинают движение в сторону игрока, если он находится в зоне их действия, подходит вплотную или наносит урон. - ГОТОВО!!!
// Вы также можете добавить им режим патрулирования, движение вперёд-назад от и до указанных точек, пока персонажа игрока нет в зоне действия.

// 12 - СОЗДАТЬ АНИМАЦИИ ПРОТИВНИКА
// 12.1 - idle
// 12.2 - walk
// 12.3 - attack

// 13 - РЕАЛИЗОВАТЬ ШКАЛУ ЗДОРОВЬЯ ПРОТИВНИКА

// 14 СОЗДАТЬ ПРОТИВНИКА ДАЛЬНЕГО БОЯ:
// Враг, имеющий стрелковое оружие, начинает стрелять в сторону персонажа игрока когда персонаж находится в зоне действия врага.
// Вы также можете реализовать для этих врагов режим патрулирования.

// 15 СОЗДАТЬ УРОВЕНЬ: СТЕНЫ, ПОЛ, ПОТОЛОК (ЕСЛИ НАДО), БЕЗ ЗАПОЛНЕНИЯ ИНТЕРАКТИВОМ

// 16 СОЗДАТЬ ОПАСНЫЕ ЗОНЫ:
// В игре должны присутствовать опасные зоны: это могут быть шипы, огонь и так далее.
// Когда персонаж игрока находится в «опасной зоне», ему наносится урон (отнимается здоровье) с заданным интервалом, например каждые одну-две секунды.

// 17 СОЗДАТЬ ПРЕДМЕТЫ:
// На уровне можно разместить «аптечки», пополняющие здоровья игрока.
// После того как персонаж коснулся «аптечки», его здоровье восстанавливается на несколько единиц, а сама «аптечка» исчезает.

// 18 ЗАКОНЧИТЬ ЛОГИКУ УРОВНЯ, НАПОЛНИТЬ ЕГО ВРАГАМИ.

// 19 СОЗДАТЬ ГЛАВНОЕ МЕНЮ.

// 20 СОЗДАТЬ ПАНЕЛЬ НАСТРОЕК.

// 21 РЕАЛИЗОВАТЬ СОХРАНЕНИЕ НАСТРОЕК.

// 22 РЕАЛИЗОВАТЬ ЗВУКОВОЕ СОПРОВОЗДЕНИК.
// 22.1 звук клика мышки по UI
// 22.2 звук шаков
// 22.3 звук приземления
// 22.4 звук выстрла
// 22.5 звук попадания в препятствмие
// 22.6 звук попадания в пртивника
// 22.7 звук попадания в игрока
// 22.8 музыка